// ВАЖНО: Имя файла должно в точности совпадать с тем, что в папке assets!
import kafkaImg from './assets/Kafka.jpg';

export const products = [
    { 
      id: 1, 
      name: "Фигурка Kafka 1/7", 
      game: "Honkai: Star Rail", 
      price: 12500, 
      img: kafkaImg, // Используем импортированную картинку
      desc: "Оригинальная детализированная фигурка Кафки. Масштаб 1/7, высота 25 см. Идеальное дополнение к твоей коллекции!" 
    },
    { 
      id: 2, 
      name: "Худи Raiden Shogun", 
      game: "Genshin Impact", 
      price: 4200, 
      img: "⚡", // Эмодзи пока нет реальных фото
      desc: "Теплое оверсайз худи с неоновым принтом Электро Архонта. Материал: 100% плотный хлопок." 
    },
    { 
      id: 3, 
      name: "Акриловый стенд Amiya", 
      game: "Arknights", 
      price: 1500, 
      img: "🐰", 
      desc: "Официальный акриловый стенд с Амией. Отличный подарок для любого Доктора. Высота 15 см." 
    },
    { 
      id: 4, 
      name: "Плюшевая игрушка Pom-Pom", 
      game: "Honkai: Star Rail", 
      price: 2800, 
      img: "🚂", 
      desc: "Мягкая плюшевая игрушка проводника Звездного Экспресса. Очень приятная на ощупь!" 
    },
    { 
      id: 5, 
      name: "Значок Elysia", 
      game: "Honkai: 3rd", 
      price: 500, 
      img: "🌸", 
      desc: "Металлический значок с прекрасной Элизией. Крепкая застежка, не выцветает." 
    }
];

export const categories = ["Все", "Honkai: Star Rail", "Genshin Impact", "Honkai: 3rd", "Arknights"];