import kafkaImg from './assets/Kafka.jpg';

export const products = [
    { 
      id: 1, 
      name: "Фигурка Kafka 1/7", 
      game: "Honkai: Star Rail", 
      price: 12500, 
      img: kafkaImg, 
      desc: "Оригинальная детализированная фигурка Кафки. Масштаб 1/7, высота 25 см.",
      tgLink: "https://t.me/sheep2me_test/2" // <-- СЮДА БУДЕШЬ ВСТАВЛЯТЬ ССЫЛКУ НА ПОСТ
    },
    { 
      id: 2, 
      name: "Худи Raiden Shogun", 
      game: "Genshin Impact", 
      price: 4200, 
      img: "⚡", 
      desc: "Теплое оверсайз худи с неоновым принтом Электро Архонта. Материал: 100% плотный хлопок.",
      tgLink: "https://t.me/sheep2me_test/2"
    },
    { 
      id: 3, 
      name: "Акриловый стенд Amiya", 
      game: "Arknights", 
      price: 1500, 
      img: "🐰", 
      desc: "Официальный акриловый стенд с Амией. Отличный подарок для любого Доктора.",
      tgLink: "https://t.me/sheep2me_test/2"
    },
    { 
      id: 4, 
      name: "Плюшевая игрушка Pom-Pom", 
      game: "Honkai: Star Rail", 
      price: 2800, 
      img: "🚂", 
      desc: "Мягкая плюшевая игрушка проводника Звездного Экспресса.",
      tgLink: "https://t.me/sheep2me_test/2"
    },
    { 
      id: 5, 
      name: "Значок Elysia", 
      game: "Honkai: 3rd", 
      price: 500, 
      img: "🌸", 
      desc: "Металлический значок с прекрасной Элизией. Крепкая застежка.",
      tgLink: "" // Если ссылки нет, оставляем пустым, кнопка просто не появится
    }
];

export const categories = ["Все", "Honkai: Star Rail", "Genshin Impact", "Honkai: 3rd", "Arknights"];